jmeter/test/jmx/Postgresql.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Postgrsql -DB Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">$JMETER_DIR/lib/postgresql-$JDBC_DRIVER_VERSON.jar</stringProp>
    </TestPlan>
    <hashTree>
      <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="User Parameters" enabled="true">
        <collectionProp name="UserParameters.names">
          <stringProp name="393794008">JMETER_VERSION</stringProp>
          <stringProp name="192594317">JMETER_DIR</stringProp>
          <stringProp name="-1997684542">JDBC_DRIVER_VERSON</stringProp>
          <stringProp name="-1810426938">PGSQL_CONNECTION</stringProp>
        </collectionProp>
        <collectionProp name="UserParameters.thread_values">
          <collectionProp name="-1797529310">
            <stringProp name="50366524">5.2.1</stringProp>
            <stringProp name="1050469429">${PWD}/apache-jmeter-$JMETER_VERSION</stringProp>
            <stringProp name="1536311821">42.2.9</stringProp>
            <stringProp name="-417014874">pgsql_connection</stringProp>
          </collectionProp>
          <collectionProp name="772031937">
          </collectionProp>
        </collectionProp>
        <boolProp name="UserParameters.per_iteration">false</boolProp>
      </UserParameters>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">$PGSQL_CONNECTION</stringProp>
          <stringProp name="dbUrl">jdbc:postgresql://${PGSQLServer}:${PGSQLPort}/${DB}?autoReconnect=true</stringProp>
          <stringProp name="driver">org.postgresql.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">vagrant</stringProp>
          <stringProp name="poolMax">0</stringProp>
          <boolProp name="preinit">false</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">${DBUser}</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request - Select" enabled="true">
          <stringProp name="TestPlan.comments">Select Data</stringProp>
          <stringProp name="dataSource">$PGSQL_CONNECTION</stringProp>
          <stringProp name="query">select * from customer;</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request - Insert" enabled="true">
          <stringProp name="TestPlan.comments">Insert Data</stringProp>
          <stringProp name="dataSource">$PGSQL_CONNECTION</stringProp>
          <stringProp name="queryType">Update Statement</stringProp>
          <stringProp name="query">insert into customer values (&apos;uzzal2k5-8&apos;,&apos;34&apos;,&apos;uzzal2k5-8@gmail.com&apos;,&apos;now&apos;,&apos;now&apos;);</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Check Table Existence" enabled="true">
          <stringProp name="dataSource">$PGSQL_CONNECTION</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select TABLE_NAME from information_schema.TABLES where table_schema = ${Schema};</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1504630692">table_name</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="PGSQLServer" elementType="Argument">
            <stringProp name="Argument.name">PGSQLServer</stringProp>
            <stringProp name="Argument.value">${__P(PGSQLServer,192.168.10.115)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PGSQLPort" elementType="Argument">
            <stringProp name="Argument.name">PGSQLPort</stringProp>
            <stringProp name="Argument.value">${__P(PGSQLPort,5432)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DB" elementType="Argument">
            <stringProp name="Argument.name">DB</stringProp>
            <stringProp name="Argument.value">test_db</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DBUser" elementType="Argument">
            <stringProp name="Argument.name">DBUser</stringProp>
            <stringProp name="Argument.value">vagrant</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="Schema" elementType="Argument">
            <stringProp name="Argument.name">Schema</stringProp>
            <stringProp name="Argument.value">&apos;public&apos;</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>